package com.javarush.task.task14.task1410;

/**
 * Created by User on 12.02.2017.
 * 1. Создать абстрактный класс Drink с реализованным методом public void taste(), который выводит в консоль «Вкусно«.
 */
public abstract class Drink {

    public void taste(){
        System.out.println("Вкусно");
    }

}
